Revit 2027 API
IFCParameterTemplate.ExportToFile Method
 Export mapping template to a text file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ExportToFile(
	string fileName
)
Public Sub ExportToFile (
	fileName As String
)
public:
void ExportToFile(
	String^ fileName
)
member ExportToFile :
        fileName : string -> unit
Parameters
fileName String
 The full text file name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
FileAccessException |  Failed to access the text file.
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace